In [97]:
import pandas as pd
import matplotlib.pyplot as plt

In [99]:
Data=r"C:\Users\IITM\Downloads\employee.csv"

In [101]:
df=pd.read_csv(Data)

In [103]:
df

      EID      Employee Name Gender   Salary Date of Joining   Department
0   E123D        Nitin Bhole      M  1900000      01-11-2016     Products
1   E876G     Mayur Kulkarni      M  1200000      03-06-2016    Semantics
2   E798G      Anurag Pandey      M  1200000      04-07-2016           IT
3   E123B      Pankaj Bansal      M   900000      01-12-2015     Research
4   E098Z    Rajendra Prabhu      M  1000000      11-11-2015    Semantics
5   E294M     Sumanth Mishra      M  1800000      04-09-2017     Research
6   E972L          Sai Bodha      M  1100000      11-11-2017    Semantics
7   E184A  Kushmakar Krishna      M  1100000      01-01-2015     Products
8   E104S     Amarnath Patil      M   600000      29-11-2015  Engineering
9   E093V   Shashidhar Reddy      M   700000      29-11-2018  Engineering
10  E983Q     Chakshu Bansal      F   300000      04-12-2017     Products
11  E092E       Mitali Gupta      F  1600000      02-05-2019    Semantics
12  E620Y     Kumar Abhishek      M  1100000      01-12-2014    Semantics
13  E109U     Sanket Gibbidi      M  5000000      11-01-2019     Products

In [111]:
# Convert date of joining into datetime

df['Date of Joining']=pd.to_datetime(df['Date of Joining'],dayfirst=True)

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   EID              14 non-null     object
 1   Employee Name    14 non-null     object
 2   Gender           14 non-null     object
 3   Salary           14 non-null     int64
 4   Date of Joining  14 non-null     datetime64[ns]
 5   Department       14 non-null     object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 804.0+ bytes

In [115]:
df.describe()

             Salary                Date of Joining
count  1.400000e+01                             14
mean   1.392857e+06  2017-01-02 18:51:25.714285824
min    3.000000e+05            2014-12-01 00:00:00
25%    9.250000e+05            2015-11-29 12:00:00
50%    1.100000e+06            2016-09-02 00:00:00
75%    1.500000e+06            2017-11-28 06:00:00
max    5.000000e+06            2019-05-02 00:00:00
std    1.126918e+06                            NaN

In [117]:
#Check for missing values
df.isnull().sum()

EID                0
Employee Name      0
Gender             0
Salary             0
Date of Joining    0
Department         0
dtype: int64

In [143]:
#1. Greet employee with their first name

def Greetings(EID):
    emp= df[df['EID'] == EID]
    if not emp.empty:
        name=emp.iloc[0]["Employee Name"]
        first_name = name.split()[0]
        gender = emp.iloc[0]["Gender"]
        title = "Mr" if gender.lower().startswith("m") else "Ms"
        return f"Hello, {title} {first_name}"
    return "Employee Not Found"
            
while True:
    emp_id = input("Enter Employee ID (or 'exit' to quit): ")
    if emp_id.lower() == "exit":
        print("Exiting...")
        break
    print(Greetings(emp_id))

Enter Employee ID (or 'exit' to quit):  E123B

Hello, Mr Pankaj

Enter Employee ID (or 'exit' to quit):  E983Q

Hello, Ms Chakshu

Enter Employee ID (or 'exit' to quit):  exit

Exiting...

In [121]:
#2.Function for calculating the average salary of each department
def average_salary_by_department(DataFrame):
    avgsalary=DataFrame.groupby("Department")["Salary"].mean()
    return avgsalary

print(average_salary_by_department(df))

Department
Engineering     650000.0
IT             1200000.0
Products       2075000.0
Research       1350000.0
Semantics      1200000.0
Name: Salary, dtype: float64

In [131]:
#3. Function to display employee details by ID
def get_employee_details(emp_id, dataframe):
    emp = dataframe[dataframe["EID"] == emp_id]
    if not emp.empty:
        name = emp.iloc[0]["Employee Name"]
        doj = emp.iloc[0]["Date of Joining"]
        dept = emp.iloc[0]["Department"]
        return f"{name} | {doj} | {dept}"
    else:
        return "Employee ID not found."


while True:
    emp_id = input("Enter Employee ID (or 'exit' to quit): ")
    if emp_id.lower() == "exit":
        print("Exiting...")
        break
    print(get_employee_details(emp_id, df))

Enter Employee ID (or 'exit' to quit):  E123D

Nitin Bhole | 2016-11-01 00:00:00 | Products

Enter Employee ID (or 'exit' to quit):  exit

Exiting...

In [147]:
#4.Function for sorting employee from oldest to newest.
def sort_employee_by_joining():
    sorted_df=df.sort_values(by="Date of Joining", ascending=True)
    return sorted_df[["EID", "Employee Name", "Date of Joining", "Department"]]

print(sort_employee_by_joining())

      EID      Employee Name Date of Joining   Department
12  E620Y     Kumar Abhishek      2014-12-01    Semantics
7   E184A  Kushmakar Krishna      2015-01-01     Products
4   E098Z    Rajendra Prabhu      2015-11-11    Semantics
8   E104S     Amarnath Patil      2015-11-29  Engineering
3   E123B      Pankaj Bansal      2015-12-01     Research
1   E876G     Mayur Kulkarni      2016-06-03    Semantics
2   E798G      Anurag Pandey      2016-07-04           IT
0   E123D        Nitin Bhole      2016-11-01     Products
5   E294M     Sumanth Mishra      2017-09-04     Research
6   E972L          Sai Bodha      2017-11-11    Semantics
10  E983Q     Chakshu Bansal      2017-12-04     Products
9   E093V   Shashidhar Reddy      2018-11-29  Engineering
13  E109U     Sanket Gibbidi      2019-01-11     Products
11  E092E       Mitali Gupta      2019-05-02    Semantics